[Survived] LogicalOperator
src/services/api.ts:7:22
 
 // Always use relative /api so requests go through the Vite proxy in dev
 // and through Nginx in production.
-const API_BASE_URL = import.meta.env.VITE_API_URL ?? '/api'
+const API_BASE_URL = import.meta.env.VITE_API_URL && '/api'
 
 // Exact paths that are publicly accessible — no redirect to /login on auth loss.

[Survived] StringLiteral
src/services/api.ts:11:3
 
 // Exact paths that are publicly accessible — no redirect to /login on auth loss.
 const PUBLIC_EXACT_PATHS = new Set([
-  '/', '/login', '/register',
+  "", '/login', '/register',
   '/forgot-password', '/reset-password',
   '/verify-email', '/verify-email-sent',

[Killed] StringLiteral
src/services/api.ts:12:3
 // Exact paths that are publicly accessible — no redirect to /login on auth loss.
 const PUBLIC_EXACT_PATHS = new Set([
   '/', '/login', '/register',
-  '/forgot-password', '/reset-password',
+  "", '/reset-password',
   '/verify-email', '/verify-email-sent',
   '/dashboard',   // public browse
killedBy: ServiceEvaluationModal — photo upload failure (NFR-14d) closes the modal with a non-blocking warning when the upload fails generically
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
src/services/api.ts:13:20
 const PUBLIC_EXACT_PATHS = new Set([
   '/', '/login', '/register',
   '/forgot-password', '/reset-password',
-  '/verify-email', '/verify-email-sent',
+  '/verify-email', "",
   '/dashboard',   // public browse
   '/forum',       // forum listing
killedBy: ServiceEvaluationModal — photo upload failure (NFR-14d) uses the file-too-large copy when the upload returns 413
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
src/services/api.ts:13:3
 const PUBLIC_EXACT_PATHS = new Set([
   '/', '/login', '/register',
   '/forgot-password', '/reset-password',
-  '/verify-email', '/verify-email-sent',
+  "", '/verify-email-sent',
   '/dashboard',   // public browse
   '/forum',       // forum listing
killedBy: ServiceEvaluationModal — photo upload failure (NFR-14d) closes the modal with a non-blocking warning when the upload fails generically
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
src/services/api.ts:19:3
 ])
 // Path prefixes that are also public (dynamic routes)
 const PUBLIC_PREFIX_PATHS = [
-  '/service-detail/',
+  "",
   '/public-profile/',
   '/forum/',
killedBy: ServiceEvaluationModal — photo upload failure (NFR-14d) closes the modal with a non-blocking warning when the upload fails generically
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[NoCoverage] ConditionalExpression
src/services/api.ts:25:10
 ]
 const isPublicPath = () => {
   const p = window.location.pathname
-  return PUBLIC_EXACT_PATHS.has(p) || PUBLIC_PREFIX_PATHS.some((prefix) => p.startsWith(prefix))
+  return true
 }
 

[NoCoverage] ArrowFunction
src/services/api.ts:25:64
 ]
 const isPublicPath = () => {
   const p = window.location.pathname
-  return PUBLIC_EXACT_PATHS.has(p) || PUBLIC_PREFIX_PATHS.some((prefix) => p.startsWith(prefix))
+  return PUBLIC_EXACT_PATHS.has(p) || PUBLIC_PREFIX_PATHS.some(() => undefined)
 }
 

[Survived] BooleanLiteral
src/services/api.ts:33:20
   baseURL: API_BASE_URL,
   headers: { 'Content-Type': 'application/json' },
   timeout: API_TIMEOUT,
-  withCredentials: true, // send cookies with every request
+  withCredentials: false, // send cookies with every request
 })
 

[Survived] BooleanLiteral
src/services/api.ts:37:20
 })
 
 // ─── Token Refresh Queue ────────────────────────────────────────────────────
-let isRefreshing = false
+let isRefreshing = true
 let refreshPromise: Promise<void> | null = null
 let failedQueue: Array<{

[NoCoverage] BlockStatement
src/services/api.ts:44:42
   reject: (error: unknown) => void
 }> = []
 
-const processQueue = (error: unknown) => {
-  failedQueue.forEach((prom) => {
-    if (error) prom.reject(error)
-    else prom.resolve()
-  })
-  failedQueue = []
-}
+const processQueue = (error: unknown) => {}
 
 // ─── Request Interceptor ─────────────────────────────────────────────────────

[NoCoverage] BlockStatement
src/services/api.ts:45:33
 }> = []
 
 const processQueue = (error: unknown) => {
-  failedQueue.forEach((prom) => {
-    if (error) prom.reject(error)
-    else prom.resolve()
-  })
+  failedQueue.forEach((prom) => {})
   failedQueue = []
 }

[NoCoverage] ConditionalExpression
src/services/api.ts:46:9
 
 const processQueue = (error: unknown) => {
   failedQueue.forEach((prom) => {
-    if (error) prom.reject(error)
+    if (true) prom.reject(error)
     else prom.resolve()
   })

[NoCoverage] ConditionalExpression
src/services/api.ts:46:9
 
 const processQueue = (error: unknown) => {
   failedQueue.forEach((prom) => {
-    if (error) prom.reject(error)
+    if (false) prom.reject(error)
     else prom.resolve()
   })

[Survived] ArrowFunction
src/services/api.ts:58:3
 // JWTAuthentication to raise AuthenticationFailed on public endpoints like /register.
 apiClient.interceptors.request.use(
   (config: InternalAxiosRequestConfig) => config,
-  (error) => Promise.reject(error),
+  () => undefined,
 )
 

[NoCoverage] OptionalChaining
src/services/api.ts:66:32
   (response) => response,
   async (error) => {
     const originalRequest = error.config
-    const requestUrl: string = originalRequest?.url ?? ''
+    const requestUrl: string = originalRequest.url ?? ''
 
     const isAuthEndpoint = (url: string) =>

[NoCoverage] LogicalOperator
src/services/api.ts:66:32
   (response) => response,
   async (error) => {
     const originalRequest = error.config
-    const requestUrl: string = originalRequest?.url ?? ''
+    const requestUrl: string = originalRequest?.url && ''
 
     const isAuthEndpoint = (url: string) =>

[NoCoverage] ConditionalExpression
src/services/api.ts:69:7
     const requestUrl: string = originalRequest?.url ?? ''
 
     const isAuthEndpoint = (url: string) =>
-      url.includes('/auth/login/') ||
-      url.includes('/auth/register/') ||
-      url.includes('/auth/refresh/') ||
-      url.includes('/auth/logout/')
+      true
 
     if (error.response?.status === 401 && !originalRequest._retry) {

[NoCoverage] ConditionalExpression
src/services/api.ts:69:7
     const requestUrl: string = originalRequest?.url ?? ''
 
     const isAuthEndpoint = (url: string) =>
-      url.includes('/auth/login/') ||
-      url.includes('/auth/register/') ||
-      url.includes('/auth/refresh/') ||
-      url.includes('/auth/logout/')
+      false
 
     if (error.response?.status === 401 && !originalRequest._retry) {

[NoCoverage] ConditionalExpression
src/services/api.ts:74:9
       url.includes('/auth/refresh/') ||
       url.includes('/auth/logout/')
 
-    if (error.response?.status === 401 && !originalRequest._retry) {
+    if (false) {
       if (isAuthEndpoint(requestUrl)) return Promise.reject(error)
 

[NoCoverage] OptionalChaining
src/services/api.ts:74:9
       url.includes('/auth/refresh/') ||
       url.includes('/auth/logout/')
 
-    if (error.response?.status === 401 && !originalRequest._retry) {
+    if (error.response.status === 401 && !originalRequest._retry) {
       if (isAuthEndpoint(requestUrl)) return Promise.reject(error)
 

[NoCoverage] ConditionalExpression
src/services/api.ts:75:11
       url.includes('/auth/logout/')
 
     if (error.response?.status === 401 && !originalRequest._retry) {
-      if (isAuthEndpoint(requestUrl)) return Promise.reject(error)
+      if (true) return Promise.reject(error)
 
       // Check if we have a refresh_token cookie (httponly, can't read value but presence check via request)

[NoCoverage] ConditionalExpression
src/services/api.ts:75:11
       url.includes('/auth/logout/')
 
     if (error.response?.status === 401 && !originalRequest._retry) {
-      if (isAuthEndpoint(requestUrl)) return Promise.reject(error)
+      if (false) return Promise.reject(error)
 
       // Check if we have a refresh_token cookie (httponly, can't read value but presence check via request)

[NoCoverage] BooleanLiteral
src/services/api.ts:78:32
       if (isAuthEndpoint(requestUrl)) return Promise.reject(error)
 
       // Check if we have a refresh_token cookie (httponly, can't read value but presence check via request)
-      originalRequest._retry = true
+      originalRequest._retry = false
 
       if (isRefreshing) {

[NoCoverage] ConditionalExpression
src/services/api.ts:80:11
       // Check if we have a refresh_token cookie (httponly, can't read value but presence check via request)
       originalRequest._retry = true
 
-      if (isRefreshing) {
+      if (true) {
         return new Promise((resolve, reject) => {
           failedQueue.push({ resolve, reject })

[NoCoverage] BlockStatement
src/services/api.ts:80:25
       // Check if we have a refresh_token cookie (httponly, can't read value but presence check via request)
       originalRequest._retry = true
 
-      if (isRefreshing) {
-        return new Promise((resolve, reject) => {
-          failedQueue.push({ resolve, reject })
-        })
-          .then(() => apiClient(originalRequest))
-          .catch((err) => Promise.reject(err))
-      }
+      if (isRefreshing) {}
 
       isRefreshing = true

[NoCoverage] BlockStatement
src/services/api.ts:81:49
       originalRequest._retry = true
 
       if (isRefreshing) {
-        return new Promise((resolve, reject) => {
-          failedQueue.push({ resolve, reject })
-        })
+        return new Promise((resolve, reject) => {})
           .then(() => apiClient(originalRequest))
           .catch((err) => Promise.reject(err))

[NoCoverage] ArrowFunction
src/services/api.ts:84:17
         return new Promise((resolve, reject) => {
           failedQueue.push({ resolve, reject })
         })
-          .then(() => apiClient(originalRequest))
+          .then(() => undefined)
           .catch((err) => Promise.reject(err))
       }

[NoCoverage] ArrowFunction
src/services/api.ts:85:18
           failedQueue.push({ resolve, reject })
         })
           .then(() => apiClient(originalRequest))
-          .catch((err) => Promise.reject(err))
+          .catch(() => undefined)
       }
 

[NoCoverage] BooleanLiteral
src/services/api.ts:88:22
           .catch((err) => Promise.reject(err))
       }
 
-      isRefreshing = true
+      isRefreshing = false
 
       if (!refreshPromise) {

[NoCoverage] ConditionalExpression
src/services/api.ts:90:11
 
       isRefreshing = true
 
-      if (!refreshPromise) {
+      if (false) {
         refreshPromise = (async () => {
           try {

[NoCoverage] BlockStatement
src/services/api.ts:92:15
 
       if (!refreshPromise) {
         refreshPromise = (async () => {
-          try {
-            // Backend reads refresh_token cookie, returns new access_token cookie
-            await axios.post(
-              `${API_BASE_URL}/auth/refresh/`,
-              {},
-              { withCredentials: true },
-            )
-            processQueue(null)
-          } catch (refreshError: unknown) {
+          try {} catch (refreshError: unknown) {
             processQueue(refreshError)
             const e = refreshError as { response?: { status?: number } }

[NoCoverage] BooleanLiteral
src/services/api.ts:97:34
             await axios.post(
               `${API_BASE_URL}/auth/refresh/`,
               {},
-              { withCredentials: true },
+              { withCredentials: false },
             )
             processQueue(null)

[NoCoverage] BlockStatement
src/services/api.ts:100:43
               { withCredentials: true },
             )
             processQueue(null)
-          } catch (refreshError: unknown) {
-            processQueue(refreshError)
-            const e = refreshError as { response?: { status?: number } }
-            // Only redirect if refresh definitively failed AND user is on a protected page.
-            // Never redirect on public pages — that causes an infinite reload loop.
-            if (
-              [400, 401, 403].includes(e.response?.status ?? 0) &&
-              !isPublicPath()
-            ) {
-              window.location.href = '/login?error=session_expired'
-            }
-            throw refreshError
-          } finally {
+          } catch (refreshError: unknown) {} finally {
             isRefreshing = false
             refreshPromise = null

[NoCoverage] LogicalOperator
src/services/api.ts:106:15
             // Only redirect if refresh definitively failed AND user is on a protected page.
             // Never redirect on public pages — that causes an infinite reload loop.
             if (
-              [400, 401, 403].includes(e.response?.status ?? 0) &&
-              !isPublicPath()
+              [400, 401, 403].includes(e.response?.status ?? 0) || !isPublicPath()
             ) {
               window.location.href = '/login?error=session_expired'

[NoCoverage] ConditionalExpression
src/services/api.ts:106:15
             // Only redirect if refresh definitively failed AND user is on a protected page.
             // Never redirect on public pages — that causes an infinite reload loop.
             if (
-              [400, 401, 403].includes(e.response?.status ?? 0) &&
-              !isPublicPath()
+              false
             ) {
               window.location.href = '/login?error=session_expired'

[NoCoverage] BooleanLiteral
src/services/api.ts:107:15
             // Never redirect on public pages — that causes an infinite reload loop.
             if (
               [400, 401, 403].includes(e.response?.status ?? 0) &&
-              !isPublicPath()
+              isPublicPath()
             ) {
               window.location.href = '/login?error=session_expired'

[NoCoverage] BlockStatement
src/services/api.ts:108:15
             if (
               [400, 401, 403].includes(e.response?.status ?? 0) &&
               !isPublicPath()
-            ) {
-              window.location.href = '/login?error=session_expired'
-            }
+            ) {}
             throw refreshError
           } finally {

[NoCoverage] BlockStatement
src/services/api.ts:112:21
               window.location.href = '/login?error=session_expired'
             }
             throw refreshError
-          } finally {
-            isRefreshing = false
-            refreshPromise = null
-          }
+          } finally {}
         })()
       }

[NoCoverage] BooleanLiteral
src/services/api.ts:113:28
             }
             throw refreshError
           } finally {
-            isRefreshing = false
+            isRefreshing = true
             refreshPromise = null
           }

[NoCoverage] BlockStatement
src/services/api.ts:119:11
         })()
       }
 
-      try {
-        await refreshPromise
-        // New access_token cookie is now set — just retry, cookie is sent automatically
-        return apiClient(originalRequest)
-      } catch (refreshError) {
+      try {} catch (refreshError) {
         return Promise.reject(refreshError)
       }

[NoCoverage] BlockStatement
src/services/api.ts:123:30
         await refreshPromise
         // New access_token cookie is now set — just retry, cookie is sent automatically
         return apiClient(originalRequest)
-      } catch (refreshError) {
-        return Promise.reject(refreshError)
-      }
+      } catch (refreshError) {}
     }
 

[Killed] EqualityOperator
src/services/api.ts:155:16
 ): string {
   if (typeof error === 'string') return error
 
-  if (error && typeof error === 'object') {
+  if (error && typeof error !== 'object') {
     const e = error as ApiError
     if (e.response?.data) {
killedBy: getErrorMessage returns response.data.detail for the standard DRF auth error
statusReason: expected 'An unexpected error occurred.' to be 'Authentication credentials were not p…' // Object.is equality

[Killed] ConditionalExpression
src/services/api.ts:155:7
 ): string {
   if (typeof error === 'string') return error
 
-  if (error && typeof error === 'object') {
+  if (true) {
     const e = error as ApiError
     if (e.response?.data) {
killedBy: getErrorMessage returns the supplied default when the input is undefined
statusReason: Cannot read properties of undefined (reading 'response')

[Killed] LogicalOperator
src/services/api.ts:162:11
 
       // DRF field validation errors: { email: ["..."], password: ["..."] }
       // (no 'detail' key, just field→string[] pairs)
-      if (typeof data === 'object' && !Array.isArray(data)) {
+      if (typeof data === 'object' || !Array.isArray(data)) {
         const knownTopKeys = new Set(['detail', 'code', 'field_errors', 'error', 'message', 'messages'])
         const fieldKeys = Object.keys(data).filter((k) => !knownTopKeys.has(k))
killedBy: getErrorMessage does not treat an Array response body as a field-error map
statusReason: expected 'a. b' to be 'axios error' // Object.is equality

[Killed] ConditionalExpression
src/services/api.ts:162:11
 
       // DRF field validation errors: { email: ["..."], password: ["..."] }
       // (no 'detail' key, just field→string[] pairs)
-      if (typeof data === 'object' && !Array.isArray(data)) {
+      if (true) {
         const knownTopKeys = new Set(['detail', 'code', 'field_errors', 'error', 'message', 'messages'])
         const fieldKeys = Object.keys(data).filter((k) => !knownTopKeys.has(k))
killedBy: getErrorMessage does not treat an Array response body as a field-error map
statusReason: expected 'a. b' to be 'axios error' // Object.is equality

[Survived] StringLiteral
src/services/api.ts:163:73
       // DRF field validation errors: { email: ["..."], password: ["..."] }
       // (no 'detail' key, just field→string[] pairs)
       if (typeof data === 'object' && !Array.isArray(data)) {
-        const knownTopKeys = new Set(['detail', 'code', 'field_errors', 'error', 'message', 'messages'])
+        const knownTopKeys = new Set(['detail', 'code', 'field_errors', "", 'message', 'messages'])
         const fieldKeys = Object.keys(data).filter((k) => !knownTopKeys.has(k))
         const inlineFieldErrors = fieldKeys

[Killed] ArrowFunction
src/services/api.ts:164:52
       // (no 'detail' key, just field→string[] pairs)
       if (typeof data === 'object' && !Array.isArray(data)) {
         const knownTopKeys = new Set(['detail', 'code', 'field_errors', 'error', 'message', 'messages'])
-        const fieldKeys = Object.keys(data).filter((k) => !knownTopKeys.has(k))
+        const fieldKeys = Object.keys(data).filter(() => undefined)
         const inlineFieldErrors = fieldKeys
           .map((k) => {
killedBy: getErrorMessage combines detail with inline field-error arrays
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/services/api.ts:164:59
       // (no 'detail' key, just field→string[] pairs)
       if (typeof data === 'object' && !Array.isArray(data)) {
         const knownTopKeys = new Set(['detail', 'code', 'field_errors', 'error', 'message', 'messages'])
-        const fieldKeys = Object.keys(data).filter((k) => !knownTopKeys.has(k))
+        const fieldKeys = Object.keys(data).filter((k) => knownTopKeys.has(k))
         const inlineFieldErrors = fieldKeys
           .map((k) => {
killedBy: getErrorMessage returns response.data.detail for the standard DRF auth error
statusReason: expected 'Authentication credentials were not p…' to be 'Authentication credentials were not p…' // Object.is equality

[Killed] ConditionalExpression
src/services/api.ts:175:24
           .filter(Boolean) as string[]
 
         // detail is present — primary message
-        const detail = typeof data.detail === 'string' ? data.detail : ''
+        const detail = false ? data.detail : ''
 
         // field_errors from our own error format
killedBy: getErrorMessage combines detail with inline field-error arrays
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/services/api.ts:175:24
           .filter(Boolean) as string[]
 
         // detail is present — primary message
-        const detail = typeof data.detail === 'string' ? data.detail : ''
+        const detail = typeof data.detail !== 'string' ? data.detail : ''
 
         // field_errors from our own error format
killedBy: getErrorMessage combines detail with inline field-error arrays
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/services/api.ts:179:32
 
         // field_errors from our own error format
         const fieldErrors: string[] = []
-        if (data.field_errors) {
-          for (const [, errors] of Object.entries(data.field_errors)) {
-            if (Array.isArray(errors)) fieldErrors.push(errors.join(', '))
-          }
-        }
+        if (data.field_errors) {}
 
         // Combine all available field messages
killedBy: getErrorMessage renders field_errors keyed under that name
statusReason: expected 'axios error' to be 'Invalid email., Already taken.' // Object.is equality

[Killed] BlockStatement
src/services/api.ts:180:71
         // field_errors from our own error format
         const fieldErrors: string[] = []
         if (data.field_errors) {
-          for (const [, errors] of Object.entries(data.field_errors)) {
-            if (Array.isArray(errors)) fieldErrors.push(errors.join(', '))
-          }
+          for (const [, errors] of Object.entries(data.field_errors)) {}
         }
 
killedBy: getErrorMessage renders field_errors keyed under that name
statusReason: expected 'axios error' to be 'Invalid email., Already taken.' // Object.is equality

[Killed] ConditionalExpression
src/services/api.ts:181:17
         const fieldErrors: string[] = []
         if (data.field_errors) {
           for (const [, errors] of Object.entries(data.field_errors)) {
-            if (Array.isArray(errors)) fieldErrors.push(errors.join(', '))
+            if (false) fieldErrors.push(errors.join(', '))
           }
         }
killedBy: getErrorMessage renders field_errors keyed under that name
statusReason: expected 'axios error' to be 'Invalid email., Already taken.' // Object.is equality

[Survived] ConditionalExpression
src/services/api.ts:181:17
         const fieldErrors: string[] = []
         if (data.field_errors) {
           for (const [, errors] of Object.entries(data.field_errors)) {
-            if (Array.isArray(errors)) fieldErrors.push(errors.join(', '))
+            if (true) fieldErrors.push(errors.join(', '))
           }
         }

[Killed] ConditionalExpression
src/services/api.ts:188:13
         // Combine all available field messages
         const allFieldErrors = [...inlineFieldErrors, ...fieldErrors]
 
-        if (detail) return allFieldErrors.length ? `${detail}: ${allFieldErrors.join('. ')}` : detail
+        if (true) return allFieldErrors.length ? `${detail}: ${allFieldErrors.join('. ')}` : detail
         if (allFieldErrors.length) return allFieldErrors.join('. ')
         if (data.error) return String(data.error)
killedBy: getErrorMessage renders inline field-error arrays even without a detail key
statusReason: expected ': Already taken.' to be 'Already taken.' // Object.is equality

[Killed] ConditionalExpression
src/services/api.ts:188:13
         // Combine all available field messages
         const allFieldErrors = [...inlineFieldErrors, ...fieldErrors]
 
-        if (detail) return allFieldErrors.length ? `${detail}: ${allFieldErrors.join('. ')}` : detail
+        if (false) return allFieldErrors.length ? `${detail}: ${allFieldErrors.join('. ')}` : detail
         if (allFieldErrors.length) return allFieldErrors.join('. ')
         if (data.error) return String(data.error)
killedBy: getErrorMessage combines detail with inline field-error arrays
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/services/api.ts:189:13
         const allFieldErrors = [...inlineFieldErrors, ...fieldErrors]
 
         if (detail) return allFieldErrors.length ? `${detail}: ${allFieldErrors.join('. ')}` : detail
-        if (allFieldErrors.length) return allFieldErrors.join('. ')
+        if (true) return allFieldErrors.join('. ')
         if (data.error) return String(data.error)
         if (data.message) return String(data.message)
killedBy: getErrorMessage falls back to data.error when no detail or field errors are present
statusReason: expected '' to be 'Bad gateway' // Object.is equality

[Killed] ConditionalExpression
src/services/api.ts:189:13
         const allFieldErrors = [...inlineFieldErrors, ...fieldErrors]
 
         if (detail) return allFieldErrors.length ? `${detail}: ${allFieldErrors.join('. ')}` : detail
-        if (allFieldErrors.length) return allFieldErrors.join('. ')
+        if (false) return allFieldErrors.join('. ')
         if (data.error) return String(data.error)
         if (data.message) return String(data.message)
killedBy: getErrorMessage renders inline field-error arrays even without a detail key
statusReason: expected 'axios error' to be 'Already taken.' // Object.is equality

[Killed] ConditionalExpression
src/services/api.ts:190:13
 
         if (detail) return allFieldErrors.length ? `${detail}: ${allFieldErrors.join('. ')}` : detail
         if (allFieldErrors.length) return allFieldErrors.join('. ')
-        if (data.error) return String(data.error)
+        if (false) return String(data.error)
         if (data.message) return String(data.message)
       }
killedBy: getErrorMessage falls back to data.error when no detail or field errors are present
statusReason: expected 'axios error' to be 'Bad gateway' // Object.is equality

[Killed] ConditionalExpression
src/services/api.ts:190:13
 
         if (detail) return allFieldErrors.length ? `${detail}: ${allFieldErrors.join('. ')}` : detail
         if (allFieldErrors.length) return allFieldErrors.join('. ')
-        if (data.error) return String(data.error)
+        if (true) return String(data.error)
         if (data.message) return String(data.message)
       }
killedBy: getErrorMessage falls back to data.message when only a message key is present
statusReason: expected 'undefined' to be 'Service unavailable' // Object.is equality

[Killed] ConditionalExpression
src/services/api.ts:191:13
         if (detail) return allFieldErrors.length ? `${detail}: ${allFieldErrors.join('. ')}` : detail
         if (allFieldErrors.length) return allFieldErrors.join('. ')
         if (data.error) return String(data.error)
-        if (data.message) return String(data.message)
+        if (false) return String(data.message)
       }
 
killedBy: getErrorMessage falls back to data.message when only a message key is present
statusReason: expected 'axios error' to be 'Service unavailable' // Object.is equality

[Killed] ConditionalExpression
src/services/api.ts:191:13
         if (detail) return allFieldErrors.length ? `${detail}: ${allFieldErrors.join('. ')}` : detail
         if (allFieldErrors.length) return allFieldErrors.join('. ')
         if (data.error) return String(data.error)
-        if (data.message) return String(data.message)
+        if (true) return String(data.message)
       }
 
killedBy: getErrorMessage renders a top-level messages array (not in the known-keys set as a singular)
statusReason: expected 'undefined' to be 'axios error' // Object.is equality

[Killed] ConditionalExpression
src/services/api.ts:195:11
       }
 
       // DRF token/auth errors: { detail: "...", code: "...", messages: [...] }
-      if (typeof data.detail === 'string') return data.detail
+      if (true) return data.detail
     }
     if (e.message) return e.message
killedBy: getErrorMessage does not treat an Array response body as a field-error map
statusReason: expected undefined to be 'axios error' // Object.is equality

[Killed] EqualityOperator
src/services/api.ts:195:11
       }
 
       // DRF token/auth errors: { detail: "...", code: "...", messages: [...] }
-      if (typeof data.detail === 'string') return data.detail
+      if (typeof data.detail !== 'string') return data.detail
     }
     if (e.message) return e.message
killedBy: getErrorMessage does not treat an Array response body as a field-error map
statusReason: expected undefined to be 'axios error' // Object.is equality

[Killed] ConditionalExpression
src/services/api.ts:197:9
       // DRF token/auth errors: { detail: "...", code: "...", messages: [...] }
       if (typeof data.detail === 'string') return data.detail
     }
-    if (e.message) return e.message
+    if (false) return e.message
   }
 
killedBy: getErrorMessage falls back to e.message when there is no response payload
statusReason: expected 'An unexpected error occurred.' to be 'Network Error' // Object.is equality

[Killed] ConditionalExpression
src/services/api.ts:197:9
       // DRF token/auth errors: { detail: "...", code: "...", messages: [...] }
       if (typeof data.detail === 'string') return data.detail
     }
-    if (e.message) return e.message
+    if (true) return e.message
   }
 
killedBy: getErrorMessage returns the override default when there is nothing to extract
statusReason: expected undefined to be 'Custom fallback' // Object.is equality
