[NoCoverage] BooleanLiteral
src/utils/dateTime.ts:8:66
  */
 export function timeAgo(isoString: string): string {
   try {
-    return formatDistanceToNow(parseISO(isoString), { addSuffix: true })
+    return formatDistanceToNow(parseISO(isoString), { addSuffix: false })
   } catch {
     return isoString

[Killed] ConditionalExpression
src/utils/dateTime.ts:40:7
  * Convert hours (decimal) to a human-readable duration string
  */
 export function formatDuration(hours: number): string {
-  if (hours < 1) {
+  if (true) {
     const minutes = Math.round(hours * 60)
     return `${minutes} min`
killedBy: formatDuration formats exactly one hour
statusReason: expected '60 min' to be '1h' // Object.is equality

[Killed] BlockStatement
src/utils/dateTime.ts:40:18
  * Convert hours (decimal) to a human-readable duration string
  */
 export function formatDuration(hours: number): string {
-  if (hours < 1) {
-    const minutes = Math.round(hours * 60)
-    return `${minutes} min`
-  }
+  if (hours < 1) {}
   if (Number.isInteger(hours)) return `${hours}h`
killedBy: formatDuration formats sub-hour as minutes
statusReason: expected '0h 30min' to be '30 min' // Object.is equality

[Killed] ArithmeticOperator
src/utils/dateTime.ts:41:32
  */
 export function formatDuration(hours: number): string {
   if (hours < 1) {
-    const minutes = Math.round(hours * 60)
+    const minutes = Math.round(hours / 60)
     return `${minutes} min`
   }
killedBy: formatDuration formats sub-hour as minutes
statusReason: expected '0 min' to be '30 min' // Object.is equality

[Killed] StringLiteral
src/utils/dateTime.ts:42:12
 export function formatDuration(hours: number): string {
   if (hours < 1) {
     const minutes = Math.round(hours * 60)
-    return `${minutes} min`
+    return ``
   }
killedBy: formatDuration formats sub-hour as minutes
statusReason: expected '' to be '30 min' // Object.is equality

[Killed] StringLiteral
src/utils/dateTime.ts:45:39
     return `${minutes} min`
   }
-  if (Number.isInteger(hours)) return `${hours}h`
+  if (Number.isInteger(hours)) return ``
   const h = Math.floor(hours)
   const m = Math.round((hours - h) * 60)
killedBy: formatDuration formats exactly one hour
statusReason: expected '' to be '1h' // Object.is equality

[Killed] ArithmeticOperator
src/utils/dateTime.ts:47:24
   if (Number.isInteger(hours)) return `${hours}h`
   const h = Math.floor(hours)
-  const m = Math.round((hours - h) * 60)
+  const m = Math.round((hours - h) / 60)
   return m > 0 ? `${h}h ${m}min` : `${h}h`
 }
killedBy: formatDuration formats hours and minutes
statusReason: expected '1h' to be '1h 30min' // Object.is equality

[Killed] ArithmeticOperator
src/utils/dateTime.ts:47:25
   if (Number.isInteger(hours)) return `${hours}h`
   const h = Math.floor(hours)
-  const m = Math.round((hours - h) * 60)
+  const m = Math.round((hours + h) * 60)
   return m > 0 ? `${h}h ${m}min` : `${h}h`
 }
killedBy: formatDuration formats hours and minutes
statusReason: expected '1h 150min' to be '1h 30min' // Object.is equality

[Killed] ConditionalExpression
src/utils/dateTime.ts:48:10
   if (Number.isInteger(hours)) return `${hours}h`
   const h = Math.floor(hours)
   const m = Math.round((hours - h) * 60)
-  return m > 0 ? `${h}h ${m}min` : `${h}h`
+  return true ? `${h}h ${m}min` : `${h}h`
 }
 
killedBy: formatDuration drops the minute segment when the rounded minutes are zero
statusReason: expected '2h 0min' to be '2h' // Object.is equality

[Killed] EqualityOperator
src/utils/dateTime.ts:48:10
   if (Number.isInteger(hours)) return `${hours}h`
   const h = Math.floor(hours)
   const m = Math.round((hours - h) * 60)
-  return m > 0 ? `${h}h ${m}min` : `${h}h`
+  return m >= 0 ? `${h}h ${m}min` : `${h}h`
 }
 
killedBy: formatDuration drops the minute segment when the rounded minutes are zero
statusReason: expected '2h 0min' to be '2h' // Object.is equality

[Killed] ArithmeticOperator
src/utils/dateTime.ts:58:20
   try {
     const date = parseISO(isoString)
     const now = new Date()
-    const diffMs = now.getTime() - date.getTime()
+    const diffMs = now.getTime() + date.getTime()
     const diffHours = diffMs / (1000 * 60 * 60)
 
killedBy: chatTimestamp returns HH:mm for a timestamp within 24 hours
statusReason: expected 'May 16' to match /^\d{2}:\d{2}$/

[Killed] ArithmeticOperator
src/utils/dateTime.ts:59:23
     const date = parseISO(isoString)
     const now = new Date()
     const diffMs = now.getTime() - date.getTime()
-    const diffHours = diffMs / (1000 * 60 * 60)
+    const diffHours = diffMs * (1000 * 60 * 60)
 
     if (diffHours < 24) return format(date, 'HH:mm')
killedBy: chatTimestamp returns HH:mm for a timestamp within 24 hours
statusReason: expected 'May 16' to match /^\d{2}:\d{2}$/

[Killed] ArithmeticOperator
src/utils/dateTime.ts:59:33
     const date = parseISO(isoString)
     const now = new Date()
     const diffMs = now.getTime() - date.getTime()
-    const diffHours = diffMs / (1000 * 60 * 60)
+    const diffHours = diffMs / (1000 * 60 / 60)
 
     if (diffHours < 24) return format(date, 'HH:mm')
killedBy: chatTimestamp returns HH:mm for a timestamp within 24 hours
statusReason: expected 'May 16' to match /^\d{2}:\d{2}$/

[Killed] EqualityOperator
src/utils/dateTime.ts:61:9
     const diffMs = now.getTime() - date.getTime()
     const diffHours = diffMs / (1000 * 60 * 60)
 
-    if (diffHours < 24) return format(date, 'HH:mm')
+    if (diffHours >= 24) return format(date, 'HH:mm')
     if (diffHours < 48 * 24) return format(date, 'EEE HH:mm')
     return format(date, 'MMM d')
killedBy: chatTimestamp returns HH:mm for a timestamp within 24 hours
statusReason: expected 'Sat 07:24' to match /^\d{2}:\d{2}$/

[Killed] ConditionalExpression
src/utils/dateTime.ts:61:9
     const diffMs = now.getTime() - date.getTime()
     const diffHours = diffMs / (1000 * 60 * 60)
 
-    if (diffHours < 24) return format(date, 'HH:mm')
+    if (true) return format(date, 'HH:mm')
     if (diffHours < 48 * 24) return format(date, 'EEE HH:mm')
     return format(date, 'MMM d')
killedBy: chatTimestamp returns "EEE HH:mm" between 24 hours and 48 days ago
statusReason: expected '07:54' to match /^(Mon|Tue|Wed|Thu|Fri|Sat|Sun) \d{2}:…/

[Killed] ConditionalExpression
src/utils/dateTime.ts:62:9
     const diffHours = diffMs / (1000 * 60 * 60)
 
     if (diffHours < 24) return format(date, 'HH:mm')
-    if (diffHours < 48 * 24) return format(date, 'EEE HH:mm')
+    if (false) return format(date, 'EEE HH:mm')
     return format(date, 'MMM d')
   } catch {
killedBy: chatTimestamp returns "EEE HH:mm" between 24 hours and 48 days ago
statusReason: expected 'May 13' to match /^(Mon|Tue|Wed|Thu|Fri|Sat|Sun) \d{2}:…/

[Killed] ArithmeticOperator
src/utils/dateTime.ts:62:21
     const diffHours = diffMs / (1000 * 60 * 60)
 
     if (diffHours < 24) return format(date, 'HH:mm')
-    if (diffHours < 48 * 24) return format(date, 'EEE HH:mm')
+    if (diffHours < 48 / 24) return format(date, 'EEE HH:mm')
     return format(date, 'MMM d')
   } catch {
killedBy: chatTimestamp returns "EEE HH:mm" between 24 hours and 48 days ago
statusReason: expected 'May 13' to match /^(Mon|Tue|Wed|Thu|Fri|Sat|Sun) \d{2}:…/
