[Killed] BooleanLiteral
src/utils/eventUtils.ts:5:30
 
 /** Returns true if now is within 24 hours of the event start, or the event has already started */
 export function isWithinLockdownWindow(scheduledTime: string | null | undefined): boolean {
-  if (!scheduledTime) return false
+  if (!scheduledTime) return true
   const eventMs = new Date(scheduledTime).getTime()
   const nowMs = Date.now()
killedBy: eventUtils — time-dependent helpers isWithinLockdownWindow is false when scheduledTime is missing
statusReason: expected true to be false // Object.is equality

[Killed] ArithmeticOperator
src/utils/eventUtils.ts:8:29
   if (!scheduledTime) return false
   const eventMs = new Date(scheduledTime).getTime()
   const nowMs = Date.now()
-  return nowMs >= eventMs - 24 * 60 * 60 * 1000
+  return nowMs >= eventMs - 24 * 60 * 60 / 1000
 }
 
killedBy: eventUtils — time-dependent helpers isWithinLockdownWindow is true exactly at the 24h boundary
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/utils/eventUtils.ts:8:10
   if (!scheduledTime) return false
   const eventMs = new Date(scheduledTime).getTime()
   const nowMs = Date.now()
-  return nowMs >= eventMs - 24 * 60 * 60 * 1000
+  return true
 }
 
killedBy: eventUtils — time-dependent helpers isWithinLockdownWindow is false 25 hours away
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/utils/eventUtils.ts:13:30
 
 /** Returns true if the event is in the future (not yet started) */
 export function isFutureEvent(scheduledTime: string | null | undefined): boolean {
-  if (!scheduledTime) return false
+  if (!scheduledTime) return true
   return new Date(scheduledTime).getTime() > Date.now()
 }
killedBy: eventUtils — time-dependent helpers isFutureEvent / isEventPast both helpers are false for missing input
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/utils/eventUtils.ts:14:10
 /** Returns true if the event is in the future (not yet started) */
 export function isFutureEvent(scheduledTime: string | null | undefined): boolean {
   if (!scheduledTime) return false
-  return new Date(scheduledTime).getTime() > Date.now()
+  return new Date(scheduledTime).getTime() <= Date.now()
 }
 
killedBy: eventUtils — time-dependent helpers isFutureEvent / isEventPast isFutureEvent is true for any future timestamp
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/utils/eventUtils.ts:14:10
 /** Returns true if the event is in the future (not yet started) */
 export function isFutureEvent(scheduledTime: string | null | undefined): boolean {
   if (!scheduledTime) return false
-  return new Date(scheduledTime).getTime() > Date.now()
+  return true
 }
 
killedBy: eventUtils — time-dependent helpers isFutureEvent / isEventPast isFutureEvent is false at the exact current time
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/utils/eventUtils.ts:19:30
 
 /** Returns true if the event is in the past */
 export function isEventPast(scheduledTime: string | null | undefined): boolean {
-  if (!scheduledTime) return false
+  if (!scheduledTime) return true
   return new Date(scheduledTime).getTime() <= Date.now()
 }
killedBy: eventUtils — time-dependent helpers isFutureEvent / isEventPast both helpers are false for missing input
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/utils/eventUtils.ts:20:10
 /** Returns true if the event is in the past */
 export function isEventPast(scheduledTime: string | null | undefined): boolean {
   if (!scheduledTime) return false
-  return new Date(scheduledTime).getTime() <= Date.now()
+  return false
 }
 
killedBy: eventUtils — time-dependent helpers isFutureEvent / isEventPast isEventPast is true at the current time and false in the future
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/utils/eventUtils.ts:20:10
 /** Returns true if the event is in the past */
 export function isEventPast(scheduledTime: string | null | undefined): boolean {
   if (!scheduledTime) return false
-  return new Date(scheduledTime).getTime() <= Date.now()
+  return new Date(scheduledTime).getTime() < Date.now()
 }
 
killedBy: eventUtils — time-dependent helpers isFutureEvent / isEventPast isEventPast is true at the current time and false in the future
statusReason: expected false to be true // Object.is equality

[Killed] ArithmeticOperator
src/utils/eventUtils.ts:25:22
 
 /** Spots remaining */
 export function spotsLeft(maxParticipants: number, participantCount: number): number {
-  return Math.max(0, maxParticipants - participantCount)
+  return Math.max(0, maxParticipants + participantCount)
 }
 
killedBy: eventUtils — time-dependent helpers spotsLeft returns the difference when participants are below cap
statusReason: expected 14 to be 6 // Object.is equality

[Killed] MethodExpression
src/utils/eventUtils.ts:25:10
 
 /** Spots remaining */
 export function spotsLeft(maxParticipants: number, participantCount: number): number {
-  return Math.max(0, maxParticipants - participantCount)
+  return Math.min(0, maxParticipants - participantCount)
 }
 
killedBy: eventUtils — time-dependent helpers spotsLeft returns the difference when participants are below cap
statusReason: expected +0 to be 6 // Object.is equality

[Killed] BooleanLiteral
src/utils/eventUtils.ts:31:36
 /** Returns true when 75-99% capacity (nearly full) */
 export function isNearlyFull(maxParticipants: number, participantCount: number): boolean {
-  if (maxParticipants <= 0) return false
+  if (maxParticipants <= 0) return true
   const pct = participantCount / maxParticipants
   return pct >= 0.75 && pct < 1.0
killedBy: isNearlyFull returns false when maxParticipants is 0
statusReason: expected true to be false // Object.is equality

[Killed] ArithmeticOperator
src/utils/eventUtils.ts:32:15
 export function isNearlyFull(maxParticipants: number, participantCount: number): boolean {
   if (maxParticipants <= 0) return false
-  const pct = participantCount / maxParticipants
+  const pct = participantCount * maxParticipants
   return pct >= 0.75 && pct < 1.0
 }
killedBy: isNearlyFull returns true at exactly 75% capacity (lower boundary)
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/utils/eventUtils.ts:33:25
   if (maxParticipants <= 0) return false
   const pct = participantCount / maxParticipants
-  return pct >= 0.75 && pct < 1.0
+  return pct >= 0.75 && true
 }
 
killedBy: isNearlyFull returns false at 100% capacity (exactly full)
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/utils/eventUtils.ts:33:10
   if (maxParticipants <= 0) return false
   const pct = participantCount / maxParticipants
-  return pct >= 0.75 && pct < 1.0
+  return true
 }
 
killedBy: isNearlyFull returns false at 74% capacity (just below threshold)
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/utils/eventUtils.ts:38:36
 
 /** Returns true when at or over capacity */
 export function isEventFull(maxParticipants: number, participantCount: number): boolean {
-  if (maxParticipants <= 0) return false
+  if (maxParticipants <= 0) return true
   return participantCount >= maxParticipants
 }
killedBy: eventUtils — time-dependent helpers isEventFull is false when max_participants is zero
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/utils/eventUtils.ts:38:7
 
 /** Returns true when at or over capacity */
 export function isEventFull(maxParticipants: number, participantCount: number): boolean {
-  if (maxParticipants <= 0) return false
+  if (maxParticipants > 0) return false
   return participantCount >= maxParticipants
 }
killedBy: eventUtils — time-dependent helpers isEventFull is true at the cap
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/utils/eventUtils.ts:39:10
 /** Returns true when at or over capacity */
 export function isEventFull(maxParticipants: number, participantCount: number): boolean {
   if (maxParticipants <= 0) return false
-  return participantCount >= maxParticipants
+  return participantCount < maxParticipants
 }
 
killedBy: eventUtils — time-dependent helpers isEventFull is true at the cap
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/utils/eventUtils.ts:39:10
 /** Returns true when at or over capacity */
 export function isEventFull(maxParticipants: number, participantCount: number): boolean {
   if (maxParticipants <= 0) return false
-  return participantCount >= maxParticipants
+  return participantCount > maxParticipants
 }
 
killedBy: eventUtils — time-dependent helpers isEventFull is true at the cap
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/utils/eventUtils.ts:52:13
     year: 'numeric',
     hour: 'numeric',
     minute: '2-digit',
-    hour12: true,
+    hour12: false,
   })
 }
killedBy: eventUtils — time-dependent helpers formatEventDateTime formats a real timestamp with weekday, month, day, year and 12-hour time
statusReason: expected 'Tue, May 12, 2026, 03:00' to match /AM|PM/

[Killed] ObjectLiteral
src/utils/eventUtils.ts:59:58
 /** Format fixed group-offer dates compactly for service cards/details. */
 export function formatGroupOfferDateTime(scheduledTime: string | null | undefined): string {
   if (!scheduledTime) return 'TBD'
-  return new Date(scheduledTime).toLocaleString('en-GB', {
-    day: 'numeric',
-    month: 'short',
-    hour: '2-digit',
-    minute: '2-digit',
-    hour12: false,
-  })
+  return new Date(scheduledTime).toLocaleString('en-GB', {})
 }
 
killedBy: formatGroupOfferDateTime formats fixed group offer dates compactly with time
statusReason: expected '14/05/2026, 00:36:00' to match /14 May, \d{2}:\d{2}/

[Killed] StringLiteral
src/utils/eventUtils.ts:59:49
 /** Format fixed group-offer dates compactly for service cards/details. */
 export function formatGroupOfferDateTime(scheduledTime: string | null | undefined): string {
   if (!scheduledTime) return 'TBD'
-  return new Date(scheduledTime).toLocaleString('en-GB', {
+  return new Date(scheduledTime).toLocaleString("", {
     day: 'numeric',
     month: 'short',
killedBy: formatGroupOfferDateTime formats fixed group offer dates compactly with time
statusReason: Incorrect locale information provided

[Killed] StringLiteral
src/utils/eventUtils.ts:70:30
 
 /** Returns a human-readable countdown (e.g. "2 days away", "3 hours away") */
 export function timeUntilEvent(scheduledTime: string | null | undefined): string {
-  if (!scheduledTime) return ''
+  if (!scheduledTime) return "Stryker was here!"
   const diff = new Date(scheduledTime).getTime() - Date.now()
   if (diff <= 0) return 'Event started'
killedBy: eventUtils — time-dependent helpers timeUntilEvent returns an empty string when the input is missing
statusReason: expected 'Stryker was here!' to be '' // Object.is equality

[Killed] ArithmeticOperator
src/utils/eventUtils.ts:71:16
 /** Returns a human-readable countdown (e.g. "2 days away", "3 hours away") */
 export function timeUntilEvent(scheduledTime: string | null | undefined): string {
   if (!scheduledTime) return ''
-  const diff = new Date(scheduledTime).getTime() - Date.now()
+  const diff = new Date(scheduledTime).getTime() + Date.now()
   if (diff <= 0) return 'Event started'
   const mins = Math.floor(diff / 60_000)
killedBy: eventUtils — time-dependent helpers timeUntilEvent uses minutes when under one hour
statusReason: expected '41167d away' to be '45m away' // Object.is equality

[Killed] ConditionalExpression
src/utils/eventUtils.ts:72:7
 export function timeUntilEvent(scheduledTime: string | null | undefined): string {
   if (!scheduledTime) return ''
   const diff = new Date(scheduledTime).getTime() - Date.now()
-  if (diff <= 0) return 'Event started'
+  if (false) return 'Event started'
   const mins = Math.floor(diff / 60_000)
   if (mins < 60) return `${mins}m away`
killedBy: eventUtils — time-dependent helpers timeUntilEvent reports "Event started" once the event has begun
statusReason: expected '-1m away' to be 'Event started' // Object.is equality

[Killed] EqualityOperator
src/utils/eventUtils.ts:72:7
 export function timeUntilEvent(scheduledTime: string | null | undefined): string {
   if (!scheduledTime) return ''
   const diff = new Date(scheduledTime).getTime() - Date.now()
-  if (diff <= 0) return 'Event started'
+  if (diff < 0) return 'Event started'
   const mins = Math.floor(diff / 60_000)
   if (mins < 60) return `${mins}m away`
killedBy: eventUtils — time-dependent helpers timeUntilEvent reports "Event started" at the exact start moment (diff == 0)
statusReason: expected '0m away' to be 'Event started' // Object.is equality

[Killed] ArithmeticOperator
src/utils/eventUtils.ts:73:27
   if (!scheduledTime) return ''
   const diff = new Date(scheduledTime).getTime() - Date.now()
   if (diff <= 0) return 'Event started'
-  const mins = Math.floor(diff / 60_000)
+  const mins = Math.floor(diff * 60_000)
   if (mins < 60) return `${mins}m away`
   const hours = Math.floor(mins / 60)
killedBy: eventUtils — time-dependent helpers timeUntilEvent uses minutes when under one hour
statusReason: expected '112500000d away' to be '45m away' // Object.is equality

[Killed] ConditionalExpression
src/utils/eventUtils.ts:74:7
   const diff = new Date(scheduledTime).getTime() - Date.now()
   if (diff <= 0) return 'Event started'
   const mins = Math.floor(diff / 60_000)
-  if (mins < 60) return `${mins}m away`
+  if (false) return `${mins}m away`
   const hours = Math.floor(mins / 60)
   if (hours < 24) return `${hours}h away`
killedBy: eventUtils — time-dependent helpers timeUntilEvent uses minutes when under one hour
statusReason: expected '0h away' to be '45m away' // Object.is equality

[Killed] ConditionalExpression
src/utils/eventUtils.ts:74:7
   const diff = new Date(scheduledTime).getTime() - Date.now()
   if (diff <= 0) return 'Event started'
   const mins = Math.floor(diff / 60_000)
-  if (mins < 60) return `${mins}m away`
+  if (true) return `${mins}m away`
   const hours = Math.floor(mins / 60)
   if (hours < 24) return `${hours}h away`
killedBy: eventUtils — time-dependent helpers timeUntilEvent uses hours when under one day
statusReason: expected '300m away' to be '5h away' // Object.is equality

[Killed] ArithmeticOperator
src/utils/eventUtils.ts:75:28
   if (diff <= 0) return 'Event started'
   const mins = Math.floor(diff / 60_000)
   if (mins < 60) return `${mins}m away`
-  const hours = Math.floor(mins / 60)
+  const hours = Math.floor(mins * 60)
   if (hours < 24) return `${hours}h away`
   const days = Math.floor(hours / 24)
killedBy: eventUtils — time-dependent helpers timeUntilEvent uses hours when under one day
statusReason: expected '750d away' to be '5h away' // Object.is equality

[Killed] EqualityOperator
src/utils/eventUtils.ts:76:7
   const mins = Math.floor(diff / 60_000)
   if (mins < 60) return `${mins}m away`
   const hours = Math.floor(mins / 60)
-  if (hours < 24) return `${hours}h away`
+  if (hours >= 24) return `${hours}h away`
   const days = Math.floor(hours / 24)
   return `${days}d away`
killedBy: eventUtils — time-dependent helpers timeUntilEvent uses hours when under one day
statusReason: expected '0d away' to be '5h away' // Object.is equality

[Killed] ConditionalExpression
src/utils/eventUtils.ts:76:7
   const mins = Math.floor(diff / 60_000)
   if (mins < 60) return `${mins}m away`
   const hours = Math.floor(mins / 60)
-  if (hours < 24) return `${hours}h away`
+  if (false) return `${hours}h away`
   const days = Math.floor(hours / 24)
   return `${days}d away`
killedBy: eventUtils — time-dependent helpers timeUntilEvent uses hours when under one day
statusReason: expected '0d away' to be '5h away' // Object.is equality

[Killed] ArithmeticOperator
src/utils/eventUtils.ts:77:27
   if (mins < 60) return `${mins}m away`
   const hours = Math.floor(mins / 60)
   if (hours < 24) return `${hours}h away`
-  const days = Math.floor(hours / 24)
+  const days = Math.floor(hours * 24)
   return `${days}d away`
 }
killedBy: eventUtils — time-dependent helpers timeUntilEvent uses days otherwise
statusReason: expected '1728d away' to be '3d away' // Object.is equality

[Killed] ConditionalExpression
src/utils/eventUtils.ts:89:7
   scheduledTime: string | null | undefined,
   status: string | null | undefined,
 ): string {
-  if (!scheduledTime) return 'Event started'
+  if (false) return 'Event started'
   if (isFutureEvent(scheduledTime)) return timeUntilEvent(scheduledTime)
   if (status === 'Completed') return 'Ended'
killedBy: eventUtils — time-dependent helpers eventCountdownSummary reports "Event started" when scheduled_time is missing
statusReason: expected 'RSVPs closed' to be 'Event started' // Object.is equality

[Killed] BooleanLiteral
src/utils/eventUtils.ts:89:7
   scheduledTime: string | null | undefined,
   status: string | null | undefined,
 ): string {
-  if (!scheduledTime) return 'Event started'
+  if (scheduledTime) return 'Event started'
   if (isFutureEvent(scheduledTime)) return timeUntilEvent(scheduledTime)
   if (status === 'Completed') return 'Ended'
killedBy: eventUtils — time-dependent helpers eventCountdownSummary falls through to timeUntilEvent for future events
statusReason: expected 'Event started' to be '2h away' // Object.is equality

[Killed] ConditionalExpression
src/utils/eventUtils.ts:90:7
   status: string | null | undefined,
 ): string {
   if (!scheduledTime) return 'Event started'
-  if (isFutureEvent(scheduledTime)) return timeUntilEvent(scheduledTime)
+  if (true) return timeUntilEvent(scheduledTime)
   if (status === 'Completed') return 'Ended'
   if (status === 'Cancelled') return 'Cancelled'
killedBy: eventUtils — time-dependent helpers eventCountdownSummary reports "Ended" for completed past events
statusReason: expected 'Event started' to be 'Ended' // Object.is equality

[Killed] ConditionalExpression
src/utils/eventUtils.ts:90:7
   status: string | null | undefined,
 ): string {
   if (!scheduledTime) return 'Event started'
-  if (isFutureEvent(scheduledTime)) return timeUntilEvent(scheduledTime)
+  if (false) return timeUntilEvent(scheduledTime)
   if (status === 'Completed') return 'Ended'
   if (status === 'Cancelled') return 'Cancelled'
killedBy: eventUtils — time-dependent helpers eventCountdownSummary falls through to timeUntilEvent for future events
statusReason: expected 'RSVPs closed' to be '2h away' // Object.is equality

[Killed] ConditionalExpression
src/utils/eventUtils.ts:91:7
 ): string {
   if (!scheduledTime) return 'Event started'
   if (isFutureEvent(scheduledTime)) return timeUntilEvent(scheduledTime)
-  if (status === 'Completed') return 'Ended'
+  if (false) return 'Ended'
   if (status === 'Cancelled') return 'Cancelled'
   return 'RSVPs closed'
killedBy: eventUtils — time-dependent helpers eventCountdownSummary reports "Ended" for completed past events
statusReason: expected 'RSVPs closed' to be 'Ended' // Object.is equality

[Killed] ConditionalExpression
src/utils/eventUtils.ts:91:7
 ): string {
   if (!scheduledTime) return 'Event started'
   if (isFutureEvent(scheduledTime)) return timeUntilEvent(scheduledTime)
-  if (status === 'Completed') return 'Ended'
+  if (true) return 'Ended'
   if (status === 'Cancelled') return 'Cancelled'
   return 'RSVPs closed'
killedBy: eventUtils — time-dependent helpers eventCountdownSummary reports "Cancelled" for cancelled past events
statusReason: expected 'Ended' to be 'Cancelled' // Object.is equality

[Killed] ConditionalExpression
src/utils/eventUtils.ts:92:7
   if (!scheduledTime) return 'Event started'
   if (isFutureEvent(scheduledTime)) return timeUntilEvent(scheduledTime)
   if (status === 'Completed') return 'Ended'
-  if (status === 'Cancelled') return 'Cancelled'
+  if (true) return 'Cancelled'
   return 'RSVPs closed'
 }
killedBy: eventUtils — time-dependent helpers eventCountdownSummary reports "RSVPs closed" for past active events
statusReason: expected 'Cancelled' to be 'RSVPs closed' // Object.is equality

[Killed] EqualityOperator
src/utils/eventUtils.ts:92:7
   if (!scheduledTime) return 'Event started'
   if (isFutureEvent(scheduledTime)) return timeUntilEvent(scheduledTime)
   if (status === 'Completed') return 'Ended'
-  if (status === 'Cancelled') return 'Cancelled'
+  if (status !== 'Cancelled') return 'Cancelled'
   return 'RSVPs closed'
 }
killedBy: eventUtils — time-dependent helpers eventCountdownSummary reports "Cancelled" for cancelled past events
statusReason: expected 'RSVPs closed' to be 'Cancelled' // Object.is equality

[Killed] BooleanLiteral
src/utils/eventUtils.ts:98:28
 
 /** Returns true if the user is currently under an event-participation ban */
 export function isEventBanned(bannedUntil: string | null | undefined): boolean {
-  if (!bannedUntil) return false
+  if (!bannedUntil) return true
   return new Date(bannedUntil).getTime() > Date.now()
 }
killedBy: eventUtils — time-dependent helpers isEventBanned / isOrganizerBanned is false for missing input
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/utils/eventUtils.ts:99:10
 /** Returns true if the user is currently under an event-participation ban */
 export function isEventBanned(bannedUntil: string | null | undefined): boolean {
   if (!bannedUntil) return false
-  return new Date(bannedUntil).getTime() > Date.now()
+  return new Date(bannedUntil).getTime() >= Date.now()
 }
 
killedBy: eventUtils — time-dependent helpers isEventBanned / isOrganizerBanned is false at the exact expiry moment (strict greater-than, not >=)
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/utils/eventUtils.ts:99:10
 /** Returns true if the user is currently under an event-participation ban */
 export function isEventBanned(bannedUntil: string | null | undefined): boolean {
   if (!bannedUntil) return false
-  return new Date(bannedUntil).getTime() > Date.now()
+  return new Date(bannedUntil).getTime() <= Date.now()
 }
 
killedBy: eventUtils — time-dependent helpers isEventBanned / isOrganizerBanned is true when the ban expires in the future
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/utils/eventUtils.ts:104:28
 
 /** Returns true if the user is currently under an organizer ban */
 export function isOrganizerBanned(bannedUntil: string | null | undefined): boolean {
-  if (!bannedUntil) return false
+  if (!bannedUntil) return true
   return new Date(bannedUntil).getTime() > Date.now()
 }
killedBy: eventUtils — time-dependent helpers isEventBanned / isOrganizerBanned is false for missing input
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/utils/eventUtils.ts:105:10
 /** Returns true if the user is currently under an organizer ban */
 export function isOrganizerBanned(bannedUntil: string | null | undefined): boolean {
   if (!bannedUntil) return false
-  return new Date(bannedUntil).getTime() > Date.now()
+  return true
 }
 
killedBy: eventUtils — time-dependent helpers isEventBanned / isOrganizerBanned is false when the ban expired in the past
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/utils/eventUtils.ts:105:10
 /** Returns true if the user is currently under an organizer ban */
 export function isOrganizerBanned(bannedUntil: string | null | undefined): boolean {
   if (!bannedUntil) return false
-  return new Date(bannedUntil).getTime() > Date.now()
+  return false
 }
 
killedBy: eventUtils — time-dependent helpers isEventBanned / isOrganizerBanned is true when the ban expires in the future
statusReason: expected false to be true // Object.is equality
