[Killed] MethodExpression
src/utils/cookies.ts:7:17
 export function getCookie(name: string): string | null {
   const match = document.cookie
     .split(';')
-    .map((c) => c.trim())
+    .map((c) => c)
     .find((c) => c.startsWith(`${name}=`))
   return match ? decodeURIComponent(match.slice(name.length + 1)) : null
killedBy: utils/cookies getCookie returns the right value when multiple cookies are set
statusReason: expected null to be '2' // Object.is equality

[Killed] MethodExpression
src/utils/cookies.ts:8:18
   const match = document.cookie
     .split(';')
     .map((c) => c.trim())
-    .find((c) => c.startsWith(`${name}=`))
+    .find((c) => c.endsWith(`${name}=`))
   return match ? decodeURIComponent(match.slice(name.length + 1)) : null
 }
killedBy: utils/cookies getCookie returns the value for an existing cookie
statusReason: expected null to be 'abc.def.ghi' // Object.is equality

[Killed] ArrowFunction
src/utils/cookies.ts:8:11
   const match = document.cookie
     .split(';')
     .map((c) => c.trim())
-    .find((c) => c.startsWith(`${name}=`))
+    .find(() => undefined)
   return match ? decodeURIComponent(match.slice(name.length + 1)) : null
 }
killedBy: utils/cookies getCookie returns the value for an existing cookie
statusReason: expected null to be 'abc.def.ghi' // Object.is equality

[Killed] ArithmeticOperator
src/utils/cookies.ts:9:49
     .split(';')
     .map((c) => c.trim())
     .find((c) => c.startsWith(`${name}=`))
-  return match ? decodeURIComponent(match.slice(name.length + 1)) : null
+  return match ? decodeURIComponent(match.slice(name.length - 1)) : null
 }
 
killedBy: utils/cookies getCookie returns the value for an existing cookie
statusReason: expected 'n=abc.def.ghi' to be 'abc.def.ghi' // Object.is equality

[Killed] MethodExpression
src/utils/cookies.ts:9:37
     .split(';')
     .map((c) => c.trim())
     .find((c) => c.startsWith(`${name}=`))
-  return match ? decodeURIComponent(match.slice(name.length + 1)) : null
+  return match ? decodeURIComponent(match) : null
 }
 
killedBy: utils/cookies getCookie returns the value for an existing cookie
statusReason: expected 'access_token=abc.def.ghi' to be 'abc.def.ghi' // Object.is equality

[Killed] ConditionalExpression
src/utils/cookies.ts:16:31
  * Check whether any of the provided cookie names exist
  */
 export function hasCookies(...names: string[]): boolean {
-  return names.some((name) => getCookie(name) !== null)
+  return names.some((name) => false)
 }
 
killedBy: utils/cookies hasCookies returns true when at least one of the listed cookies is set
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/utils/cookies.ts:16:10
  * Check whether any of the provided cookie names exist
  */
 export function hasCookies(...names: string[]): boolean {
-  return names.some((name) => getCookie(name) !== null)
+  return names.every(name => getCookie(name) !== null)
 }
 
killedBy: utils/cookies hasCookies returns true when at least one of the listed cookies is set
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/utils/cookies.ts:22:62
 /**
  * Delete a cookie by setting its expiry to the past
  */
-export function deleteCookie(name: string, path = '/'): void {
-  document.cookie = `${name}=; path=${path}; expires=Thu, 01 Jan 1970 00:00:00 GMT`
-}
+export function deleteCookie(name: string, path = '/'): void {}
 
killedBy: utils/cookies getCookie does not match a cookie whose name is a prefix of another
statusReason: expected 'abc.def.ghi' to be null
