[Killed] ObjectLiteral
src/services/conversationAPI.ts:127:25
   listConversations: async (signal?: AbortSignal): Promise<ChatConversation[]> => {
     const res = await apiClient.get<ChatConversation[] | { results: ChatConversation[] }>(
       '/chats/',
-      { signal, params: { force: 1 } },
+      { signal, params: {} },
     )
     const data = res.data
killedBy: conversationAPI.listConversations hits /chats/ with the force flag and returns an array body unchanged
statusReason: expected "vi.fn()" to be called with arguments: [ '/chats/', …(1) ]

Received:

  1st vi.fn() call:

  [
    "/chats/",

[Killed] LogicalOperator
src/services/conversationAPI.ts:130:42
       { signal, params: { force: 1 } },
     )
     const data = res.data
-    return Array.isArray(data) ? data : (data.results ?? [])
+    return Array.isArray(data) ? data : (data.results && [])
   },
 
killedBy: conversationAPI.listConversations unwraps a paginated DRF response transparently
statusReason: expected [] to deeply equal [ { handshake_id: 'h-2' } ]

[Killed] ArrayDeclaration
src/services/conversationAPI.ts:130:58
       { signal, params: { force: 1 } },
     )
     const data = res.data
-    return Array.isArray(data) ? data : (data.results ?? [])
+    return Array.isArray(data) ? data : (data.results ?? ["Stryker was here"])
   },
 
killedBy: conversationAPI.listConversations returns an empty array when the response has no results key
statusReason: expected [ 'Stryker was here' ] to deeply equal []

[Killed] StringLiteral
src/services/conversationAPI.ts:142:55
     signal?: AbortSignal,
     pageSize = 50,
   ): Promise<ApiChatMessage[]> => {
-    const res = await apiClient.get<MessagesResponse>(`/chats/${handshakeId}/`, {
+    const res = await apiClient.get<MessagesResponse>(``, {
       params: { page_size: pageSize },
       signal,
killedBy: conversationAPI.getMessages passes through the handshake id and the page_size
statusReason: expected "vi.fn()" to be called with arguments: [ '/chats/hs-123/', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "/chats/hs-123/",

[Killed] LogicalOperator
src/services/conversationAPI.ts:146:12
       params: { page_size: pageSize },
       signal,
     })
-    return res.data.results ?? []
+    return res.data.results && []
   },
 
killedBy: conversationAPI.getMessages returns an empty list when results are missing
statusReason: expected undefined to deeply equal []

[Killed] ArrayDeclaration
src/services/conversationAPI.ts:146:32
       params: { page_size: pageSize },
       signal,
     })
-    return res.data.results ?? []
+    return res.data.results ?? ["Stryker was here"]
   },
 
killedBy: conversationAPI.getMessages returns an empty list when results are missing
statusReason: expected [ 'Stryker was here' ] to deeply equal []

[Killed] StringLiteral
src/services/conversationAPI.ts:168:7
    */
   getSessions: async (serviceId: string, signal?: AbortSignal): Promise<GroupChatSessionSummary[]> => {
     const res = await apiClient.get<{ sessions: GroupChatSessionSummary[] }>(
-      `/group-chat/${serviceId}/`,
+      ``,
       { signal, params: { list_sessions: 1 } },
     )
killedBy: groupChatAPI getSessions calls /group-chat/<id>/ with list_sessions=1
statusReason: expected "vi.fn()" to be called with arguments: [ '/group-chat/svc-1/', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "/group-chat/svc-1/",

[Killed] ObjectLiteral
src/services/conversationAPI.ts:169:7
   getSessions: async (serviceId: string, signal?: AbortSignal): Promise<GroupChatSessionSummary[]> => {
     const res = await apiClient.get<{ sessions: GroupChatSessionSummary[] }>(
       `/group-chat/${serviceId}/`,
-      { signal, params: { list_sessions: 1 } },
+      {},
     )
     return res.data.sessions ?? []
killedBy: groupChatAPI getSessions calls /group-chat/<id>/ with list_sessions=1
statusReason: expected "vi.fn()" to be called with arguments: [ '/group-chat/svc-1/', …(1) ]

Received:

  1st vi.fn() call:

  [
    "/group-chat/svc-1/",

[Killed] LogicalOperator
src/services/conversationAPI.ts:171:12
       `/group-chat/${serviceId}/`,
       { signal, params: { list_sessions: 1 } },
     )
-    return res.data.sessions ?? []
+    return res.data.sessions && []
   },
 
killedBy: groupChatAPI getSessions calls /group-chat/<id>/ with list_sessions=1
statusReason: expected [] to deeply equal [ { id: 's-1', scheduled_time: 't' } ]

[Killed] StringLiteral
src/services/conversationAPI.ts:184:7
   ): Promise<GroupChatThreadData> => {
     const params = sessionId ? { session_id: sessionId } : {}
     const res = await apiClient.get<GroupChatThreadData>(
-      `/group-chat/${serviceId}/`,
+      ``,
       { signal, params },
     )
killedBy: groupChatAPI getMessages without sessionId omits the session_id param
statusReason: expected "vi.fn()" to be called with arguments: [ '/group-chat/svc-1/', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "/group-chat/svc-1/",

[Killed] LogicalOperator
src/services/conversationAPI.ts:190:21
     return {
       service_id: res.data.service_id,
       service_title: res.data.service_title,
-      participants: res.data.participants ?? [],
+      participants: res.data.participants && [],
       messages: res.data.messages ?? [],
       session_id: res.data.session_id,
killedBy: groupChatAPI getMessages preserves non-empty participants and messages instead of replacing them with []
statusReason: expected [] to deeply equal [ { id: 'u-1', name: 'A' } ]

[Killed] ArrayDeclaration
src/services/conversationAPI.ts:190:46
     return {
       service_id: res.data.service_id,
       service_title: res.data.service_title,
-      participants: res.data.participants ?? [],
+      participants: res.data.participants ?? ["Stryker was here"],
       messages: res.data.messages ?? [],
       session_id: res.data.session_id,
killedBy: groupChatAPI getMessages defaults participants and messages to [] when they are missing
statusReason: expected [ 'Stryker was here' ] to deeply equal []

[Killed] LogicalOperator
src/services/conversationAPI.ts:191:17
       service_id: res.data.service_id,
       service_title: res.data.service_title,
       participants: res.data.participants ?? [],
-      messages: res.data.messages ?? [],
+      messages: res.data.messages && [],
       session_id: res.data.session_id,
       scheduled_time: res.data.scheduled_time,
killedBy: groupChatAPI getMessages preserves non-empty participants and messages instead of replacing them with []
statusReason: expected [] to deeply equal [ { id: 'm-1', body: 'hi' } ]

[Killed] OptionalChaining
src/services/conversationAPI.ts:225:17
     )
     return {
       room: res.data.room,
-      messages: res.data.messages?.results ?? [],
+      messages: res.data.messages.results ?? [],
     }
   },
killedBy: eventChatAPI getMessages tolerates a missing messages payload
statusReason: Cannot read properties of undefined (reading 'results')

[Killed] LogicalOperator
src/services/conversationAPI.ts:225:17
     )
     return {
       room: res.data.room,
-      messages: res.data.messages?.results ?? [],
+      messages: res.data.messages?.results && [],
     }
   },
killedBy: eventChatAPI getMessages flattens the room and messages.results pair and forwards the abort signal
statusReason: expected [] to deeply equal [ { id: 'em-1' } ]

[Killed] ConditionalExpression
src/services/conversationAPI.ts:241:19
 // Both dev and prod connect to the current host; the WS upgrade is forwarded
 // by Vite's /ws proxy rule (dev) or Nginx (prod). This respects VITE_BACKEND_URL
 // without hard-coding a port and works in Docker / LAN setups.
-const wsBase = `${window.location.protocol === 'https:' ? 'wss' : 'ws'}://${window.location.host}`
+const wsBase = `${false ? 'wss' : 'ws'}://${window.location.host}`
 
 export const buildChatWsUrl      = (id: string) => `${wsBase}/ws/chat/${id}/`
killedBy: WebSocket URL builders falls back to the wss:// scheme when the page is served over https
statusReason: expected 'ws://app.example.com/ws/chat/hs-1/' to be 'wss://app.example.com/ws/chat/hs-1/' // Object.is equality

[Killed] EqualityOperator
src/services/conversationAPI.ts:241:19
 // Both dev and prod connect to the current host; the WS upgrade is forwarded
 // by Vite's /ws proxy rule (dev) or Nginx (prod). This respects VITE_BACKEND_URL
 // without hard-coding a port and works in Docker / LAN setups.
-const wsBase = `${window.location.protocol === 'https:' ? 'wss' : 'ws'}://${window.location.host}`
+const wsBase = `${window.location.protocol !== 'https:' ? 'wss' : 'ws'}://${window.location.host}`
 
 export const buildChatWsUrl      = (id: string) => `${wsBase}/ws/chat/${id}/`
killedBy: WebSocket URL builders buildChatWsUrl uses ws:// over http and includes the handshake id
statusReason: expected 'wss://localhost:5173/ws/chat/hs-1/' to be 'ws://localhost:5173/ws/chat/hs-1/' // Object.is equality

[Killed] StringLiteral
src/services/conversationAPI.ts:247:7
 export const buildGroupChatWsUrl = (serviceId: string, sessionId?: string | null) =>
   sessionId
     ? `${wsBase}/ws/group-chat/${serviceId}/?session_id=${encodeURIComponent(sessionId)}`
-    : `${wsBase}/ws/group-chat/${serviceId}/`
+    : ``
 export const buildEventChatWsUrl = (roomId: string) => `${wsBase}/ws/public-chat/${roomId}/`
 
killedBy: WebSocket URL builders buildGroupChatWsUrl omits session_id when none is supplied
statusReason: expected '' to be 'ws://localhost:5173/ws/group-chat/svc…' // Object.is equality
